In [1]:
import numpy as np
import pandas as pd

In [76]:
names=['kim','lee','park','choi','hong']
scores=[70,80,90,75,65]
majors=['컴공','컴멀','정통','컴멀','컴공']

In [77]:
data={'names':names, 'scores':scores,'majors':majors}

In [78]:
df=pd.DataFrame(data)
df

  names  scores majors
0   kim      70     컴공
1   lee      80     컴멀
2  park      90     정통
3  choi      75     컴멀
4  hong      65     컴공

In [80]:
# groupby
df.groupby('majors').sum()
df.groupby('majors').mean()

        scores
majors
정통        90.0
컴공        67.5
컴멀        77.5

In [82]:
# sort 정렬함수
df.sort_values(by='names', ascending=False) # -> 내림차순으로 정렬

  names  scores majors
2  park      90     정통
1   lee      80     컴멀
0   kim      70     컴공
4  hong      65     컴공
3  choi      75     컴멀

In [7]:
# 2차원 배열로 만들어진 데이터인 경우
data1=[names, scores, majors]
data1

[['kim', 'lee', 'park', 'choi', 'hong'],
 [70, 80, 90, 75, 65],
 ['컴공', '컴멀', '정통', '컴멀', '컴공']]

In [9]:
df1=pd.DataFrame(data1)
df1 # -> 원하는 형태로 출력되지 않는다. -> df1 생성 후 zip으로 변경 or transpose()

     0    1     2     3     4
0  kim  lee  park  choi  hong
1   70   80    90    75    65
2   컴공   컴멀    정통    컴멀    컴공

In [14]:
df1=pd.DataFrame(data1).transpose() # -> trasnpose()로 행과 열을 교체
df1

      0   1   2
0   kim  70  컴공
1   lee  80  컴멀
2  park  90  정통
3  choi  75  컴멀
4  hong  65  컴공

In [16]:
data2=zip(data1[0],data1[1],data1[2]) # -> zip으로 data1 행과 열 변경
df2=pd.DataFrame(data2, columns=['names','scores','majors'], 
                 index=['one','two','three','four','five'])
df2

      names  scores majors
one     kim      70     컴공
two     lee      80     컴멀
three  park      90     정통
four   choi      75     컴멀
five   hong      65     컴공

In [20]:
# 데이터 검색
print(df2.names) # -> 이미 만들어진 경우에만 검색 가능
print(df2[['names','majors']]) 
# -> field 명은 순서가 없기 때문에 ['names' : 'scores'] 이런 식으로 검색 불가능

one       kim
two       lee
three    park
four     choi
five     hong
Name: names, dtype: object
      names majors
one     kim     컴공
two     lee     컴멀
three  park     정통
four   choi     컴멀
five   hong     컴공

In [38]:
#df2['sno']=[2,5,7,1,3] # -> 기존에 없는 column인 경우 새로 생성
#df2['one':'three']
#df2.loc['one'] # df2['one']은 검색 불가
#df2.iloc[0] # 위와 같은 결과
#df2.iloc[0,1]
#df2.loc['one', 'scores']
#df2.loc[:'three','scores']
#df2.loc[::2,::2] # 행과 열에서 각각 step이 2
#df2.loc[df2.scores>=80,:]

# 새로운 행을 추가할 때
df2.loc['six',:]=['jang',85,'정통',4]
df2

      names  scores majors  sno
one     kim    70.0     컴공  2.0
two     lee    80.0     컴멀  5.0
three  park    90.0     정통  7.0
four   choi    75.0     컴멀  1.0
five   hong    65.0     컴공  3.0
six    jang    85.0     정통  4.0

In [41]:
# 데이터 삭제
df3=df2.drop('one');df3 # 행 삭제
df4=df2.drop('sno',axis=1);df4

      names  scores majors
one     kim    70.0     컴공
two     lee    80.0     컴멀
three  park    90.0     정통
four   choi    75.0     컴멀
five   hong    65.0     컴공
six    jang    85.0     정통

In [43]:
kor=[70,80,75,70,75]
math=[85,75,92,70,65]
eng=[80,80,92,90,70]

data=[names,kor,math,eng]

In [46]:
df=pd.DataFrame(data).transpose()
df.columns=['name','kor','math','eng']
df.index=['one','two','three','four','five']
df

       name kor math eng
one     kim  70   85  80
two     lee  80   75  80
three  park  75   92  92
four   choi  70   70  90
five   hong  75   65  70

In [55]:
df.sum(axis=0) # 열 방향으로 모든 값이 더해짐
df1=df.iloc[:,1:] # 두 번째 열부터 끝까지
df1.sum(axis=1)

one      235.0
two      235.0
three    259.0
four     230.0
five     210.0
dtype: float64

In [65]:
df1.mean(axis=1) # axis=0은 행, axis=1은 열 방향으로 동작한다

one      78.333333
two      78.333333
three    86.333333
four     76.666667
five     70.000000
dtype: float64

In [73]:
# 상관관계

df2=pd.DataFrame(np.random.rand(6,4), columns=['A','B','C','D'],
                 index=pd.date_range('20220501',periods=6))
df2

                   A         B         C         D
2022-05-01  0.931715  0.051677  0.432944  0.930158
2022-05-02  0.419273  0.739346  0.399795  0.748746
2022-05-03  0.512477  0.973112  0.791416  0.914853
2022-05-04  0.388012  0.338207  0.414146  0.846120
2022-05-05  0.653913  0.598938  0.773613  0.878162
2022-05-06  0.403378  0.478601  0.575134  0.064201

In [74]:
df2.A.corr(df2.B)

-0.5348267733334925

In [94]:
# 사용자 함수

df1 = pd.DataFrame(np.random.randn(4,3), columns=['b','d','e'],
                   index=['Seoul','Incheon','Busan', 'Daegu'])
df1

                b         d         e
Seoul    1.677633 -0.267638  0.022957
Incheon -0.171948 -2.559830 -1.936164
Busan   -0.027996 -0.793737 -0.673033
Daegu    0.776146  0.224824  0.510630

In [95]:
func = lambda x: x.max() - x.min()
def func(x):
    return x.max() - x.min()

df1.apply(func,axis=0) #열방향
df1.apply(func,axis=1) #헹방향

Seoul      1.945271
Incheon    2.387882
Busan      0.765741
Daegu      0.551322
dtype: float64

In [92]:
# pandas 파일 처리 
# 1. python 문법으로
input_file="data/input.csv" 
output_file="data/output1.csv"

with open(input_file,'r', newline='')as reader:
    with open(output_file,'w',newline='')as writer:
        header=reader.readline()
        header=header.strip()
        header_list=header.split(',')
        print(header_list)
        
        writer.write(','.join(map(str,header_list))+'\n') 
        for row in reader:
            row=row.strip() 
            row_list=row.split(',') 
            print(row_list)
            
            writer.write(','.join(map(str,row_list))+'\n')

['Supplier Name', 'Invoice Number', 'Part Number', 'Cost', 'Purchase Date']
['A', '001-1001', '2341', '"$500', '000"', '2014-01-20']
['A', '001-1001', '5467', '500000', '2014-01-20']
['A', '001-1001', '5407', '750000', '2014-01-20']
['A', '001-1001', '2341', '750000', '2014-01-20']
['B', '50-9501', '7009', '250000', '2018-01-30']
['B', '50-9501', '7009', '250000', '2018-01-30']
['B', '50-9505', '6650', '125000', '2017-02-03']
['B', '50-9505', '6650', '125000', '2017-02-03']
['C', '920-4803', '3321', '615000', '2017-02-03']
['C', '920-4804', '3321', '615000', '2017-02-10']
['C', '920-4805', '3321', '615000', '2017-02-17']
['C', '920-4806', '3321', '615000', '2017-02-24']

In [90]:
# 2. pandas로 사용 파일처리

import sys
input_file="data/input.csv"
output_file="data/output2.scv"

# csv 파일을 읽어서 데이터프레임 양식으로 저장
data_frame=pd.read_csv(input_file)
print(data_frame)

# 데이터프레임 데이터를 csv로 저장
data_frame.to_csv(output_file,index=False) # 저장시 인덱스는 사용하지 않아도 됨

   Supplier Name Invoice Number  Part Number      Cost Purchase Date
0              A       001-1001         2341  $500,000    2014-01-20
1              A       001-1001         5467    500000    2014-01-20
2              A       001-1001         5407    750000    2014-01-20
3              A       001-1001         2341    750000    2014-01-20
4              B        50-9501         7009    250000    2018-01-30
5              B        50-9501         7009    250000    2018-01-30
6              B        50-9505         6650    125000    2017-02-03
7              B        50-9505         6650    125000    2017-02-03
8              C       920-4803         3321    615000    2017-02-03
9              C       920-4804         3321    615000    2017-02-10
10             C       920-4805         3321    615000    2017-02-17
11             C       920-4806         3321    615000    2017-02-24

In [108]:
# 3. csv 내장 모듈로 파일 처리

import csv 
import sys
input_file="data/input.csv" 
output_file="data/output3.csv"
with open(input_file,'r', newline='')as csv_in_file: 
    with open(output_file,'w',newline='')as csv_out_file:
        #필드 구분자를 쉼표(,)로 설정
        filereader=csv.reader(csv_in_file,delimiter=',') 
        filewriter=csv.writer(csv_out_file,delimiter=',')
        for row_list in filereader: 
            print(row_list)
            filewriter.writerow(row_list)

['Supplier Name', 'Invoice Number', 'Part Number', 'Cost', 'Purchase Date']
['A', '001-1001', '2341', '$500,000', '2014-01-20']
['A', '001-1001', '5467', '500000', '2014-01-20']
['A', '001-1001', '5407', '750000', '2014-01-20']
['A', '001-1001', '2341', '750000', '2014-01-20']
['B', '50-9501', '7009', '250000', '2018-01-30']
['B', '50-9501', '7009', '250000', '2018-01-30']
['B', '50-9505', '6650', '125000', '2017-02-03']
['B', '50-9505', '6650', '125000', '2017-02-03']
['C', '920-4803', '3321', '615000', '2017-02-03']
['C', '920-4804', '3321', '615000', '2017-02-10']
['C', '920-4805', '3321', '615000', '2017-02-17']
['C', '920-4806', '3321', '615000', '2017-02-24']

In [102]:
# 추가: pandas로 파일 정제 및 전처리

import sys
input_file="data/input.csv"
output_file="data/output4.scv"

# csv 파일을 읽어서 데이터프레임 양식으로 저장
df=pd.read_csv(input_file)
df['Cost']=df['Cost'].str.strip('$').str.replace(',','').astype(float) 
# $ ,문자 잘라냄 -> 데이터타입을 float으로 변경

result=df.loc[(df['Supplier Name']=='A') & (df['Cost']>600000),:]
print(result)

# 데이터프레임 데이터를 csv로 저장
result.to_csv(output_file, index=False) # 저장시 인덱스는 사용하지 않아도 됨

  Supplier Name Invoice Number  Part Number      Cost Purchase Date
2             A       001-1001         5407  750000.0    2014-01-20
3             A       001-1001         2341  750000.0    2014-01-20

In [105]:
# Cost 500000이상, 700000 미만인 데이터는?

result2=df.loc[(df['Cost']>=500000) & (df['Cost']<700000),:]
print(result2)

   Supplier Name Invoice Number  Part Number      Cost Purchase Date
0              A       001-1001         2341  500000.0    2014-01-20
1              A       001-1001         5467  500000.0    2014-01-20
8              C       920-4803         3321  615000.0    2017-02-03
9              C       920-4804         3321  615000.0    2017-02-10
10             C       920-4805         3321  615000.0    2017-02-17
11             C       920-4806         3321  615000.0    2017-02-24